# GetConstraintType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..GetConstraintType Method
RebarConstraint Class See Also
---
Returns the RebarConstraintType of a RebarConstraint.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public RebarConstraintType GetConstraintType()
```

Visual Basic
---
```text
Public Function GetConstraintType As RebarConstraintType
```

Visual C++
---
```text
public:
RebarConstraintType GetConstraintType()
```

# ### Return Value
The RebarConstraintType of the specified RebarConstraint.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstraint is no longer valid. |

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace